{
  "Title": "The Beecat",
  "Description": "[h1]Spread your wings over this barren world![/h1]\n\n[b]Disclaimer! This is a very early prototype, some things are susceptible to change or unfinished. This character\u0027s campaign is in development and hasn\u0027t been implemented yet, the world and creature spawns are the same as Hunter\u0027s for now.[/b]\n\nAn agile creature, Beecat is able to move quickly through the world, and has the ability to fly through short distances (or until they get tired), this enhanced agility and mobility comes at a cost, though, the Beecat uses some of the nutrients they consume to fuel their powerful muscles and wings, only allowing half of the nutrition acquired from the food they consume to be stored for hibernation. They make up for that, however, with the ability to store nutrients in their long and thick tail, allowing for a large amount of food to be stored for the next cycle.\n\n[hr][/hr]\n[h1]Custom features![/h1]\n[list]\n    [*][b]Wings![/b]: Press and hold [b]jump[/b] while in midair to spread your wings and glide through short distances.\n\n    [*][b]Aerial Bombardment[/b]: Spears, rocks, bombs, etc and be thrown up and down at your foes while flying.\n\n    [*][b]Stinger Combat[/b]: Use your tail\u0027s stinger to deal damage and incapacitate enemies, can also be used to escape out of an enemy\u0027s grasp.\n\n    [*][b]Fast Metabolism[/b]: Move through the world at an increased speed, however you only get half of the nutrition from the food you eat.\n\n    [*][b]Tail Reserves[/b]: Store nutrients in your tail, allowing for a large amount of food to be saved for the next cycle.\n\n    [*][b]Tail Chonk[/b]: A growing tail, which gets larger as you store more food, when at 8 or more food pips, you can hurt enemies by jumping onto them with your fat tail.\n\n    [*][b]Custom Graphics[/b]: Show your swag to the world with your beautiful wings and stripped tail, with [b]fully customizable colors[/b]!.\r\n\r\n    [*][b]Bee Pups[/b]: New Bee Pups (Bups) will be found all over the world (Requires DLC) must be Beecat campaign.\r\n\r\n    [*][b]HoneyComb[/b]: New Item! (hold GRB \u002B JMP with 3 Foodpips) to spit out!.\n[/list] \n\n[hr][/hr]\n[h1]Planned features:[/h1]\n[list]\n    [*][b]Custom campaign[/b]: A custom campaign will be added for this slugcat.\n\n    [*][b]New region[/b]: There will be a new region to explore, which will be part of their campaign.\n\n    [*][b]New creatures[/b]: New thematic creatures matching the new region\u0027s style.\n\n    [*][b]A harsher world[/b]: More aggressive enemy spawns all over the world, a fitting challenge for this powerful creature.\n\n    [*][b]Custom Art[/b]: New art for the slugcat selection screen, cutscenes and dreams.\n[/list] \n\n[hr][/hr]\n\nGitHub link for GoG users:\nhttps://github.com/MatheusVigaro/Beecat/releases/\n\nHuge thanks to Elliot (UraniumCarrot126#4166) and mae (Slurpps!#6066) for the amazing thumbnail art, and to slugcat#1008 for the cutest hibernation screen art!\n\n\nP.S.: It would be nice to have short gameplay videos for the workshop gallery, if anyone is willing to record some you can send the youtube link and I\u0027ll put it there, you can also ping me (@Vigaro) on the Rain World Discord server.\r\nIf you find some issues, please ping @MyztiLeaf (now taken care of beecat mod) so Myzti can track issue easily ^^",
  "ID": "beeworld",
  "Version": "1.5.1",
  "TargetGameVersion": "v1.9.07b",
  "Requirements": "slime-cubed.slugbase, Fisobs",
  "RequirementNames": "SlugBase. fisobs",
  "Authors": "Vigaro, MyztiLeaf",
  "Visibility": "Public",
  "Tags": [
    "Campaigns",
    "Creatures",
    "Game Mechanics",
    "Items",
    "Custom Slugcat"
  ],
  "WorkshopID": 2939738770,
  "UploadFilesOnly": true,
  "UploadThumbnail": false
}